[
    "I make tiktoks",
    {
        "total_results": 1522,
        "titles": [
            "The Chinese Queen of Cottagecore Has Suddenly Reappeared After Three Years",
            "News Influencers Have Eclipsed Traditional Media",
            "Crypto Trolls Hijacked NYC’s Dog Mayor Competition",
            "Molly-Mae Hague 'shocked' by Tommy Fury split",
            "How US election fraud claims changed as Trump won",
            "5 Ways You're Compromising Home Security With Social Media Posts",
            "Netflix's Fighting Debut Was a Disaster, and NFL Fans Are Worried",
            "Inside the Booming 'AI Pimping' Industry",
            "There's a gender gap among news influencers on social media, new Pew data shows",
            "Netflix's Jake Paul vs. Mike Tyson fight showed that getting attention is what Jake Paul does best",
            "My husband and I have been married for 60 years and eat different dinners most nights. Compromise has helped our marriage last.",
            "That famous artist you love probably isn't as rich as you think",
            "Why the running influencer Matt Choi was banned from the New York City Marathon",
            "Here’s What Gen Z Climate Activists Are Prioritizing This Coming Year",
            "A journey toward forgiveness: Davin Vann has finally found himself years after his sister's death",
            "They’re Ecstatic He Won. But the Christian “Prophets” Who Demonized Democrats Have to Pivot Now.",
            "How to Start Using Video in Your Marketing",
            "B2B Newsletter Marketing: How It Differs From Email Promotions & What Brands Can Learn from Independent Producers",
            "At town halls, Elon Musk works to harness his celebrity to boost Trump",
            "10 celebs most targeted by malicious deepfake scams, dangerous search results",
            "Optimizing B2B Conversion Rates — All My Tips and Strategies",
            "Conspiracy Theorists Think Donald Trump Used a Body Double During SpaceX Launch",
            "Almost 40% of Americans Under 30 Get News from Social Media Influencers",
            "Why Democrats Are Losing the Culture War",
            "The Screenshot That Proves You’re a ‘Real’ Writer",
            "What the Men of the Internet Are Trying to Prove",
            "Be careful what you wish for. Transgender athlete lawsuit a Pandora's box | Opinion",
            "Aunt demands 13-year-old niece's $500 backpack, one of 50 that she owns, starting rift in the family: '[She] thinks I'm being selfish'",
            "10 Sunday Reads",
            "Trendgetränk: Social Media und Sommerhit: Nachfrage nach Matcha gestiegen",
            "Social-Media-Festival: VideoDays in Köln: Creator sprechen über ihre Verantwortung",
            "Erfolgreiche Tiere im Netz: Katzen-Accounts im Rampenlicht: Auszeichnung für Petfluencer",
            "Influencer Falls to Death From Moving Car While Filming Selfie Video",
            "Influencers Drowned ‘After Refusing to Ruin Selfies With Life Jackets’",
            "Trademark Relinquished After Backlash From Trademark Bullying A Decade Ago By Pho Restaurant",
            "4B, the protest movement that boycotts men, explained",
            "How Peanut the Squirrel became an unlikely right-wing celebrity",
            "Elon Musk and the age of shameless oligarchy",
            "It’s probably time you learned about the Costco Guys",
            "Livvy Dunne, Paul Skenes to Be 'College GameDay' Guest Pickers for Week 11",
            "Mike Tyson vs. Jake Paul: Live Winners and Losers, Results",
            "The Mike Tyson Who Fought Jake Paul Wasn't the Real Mike Tyson",
            "OnlyFans Model Elsa Thora Pleads to Have Mars Baby With Elon Musk",
            "Bryce Hall Looking to Make TikToks With Donald Trump in White House",
            "Influencer Marketing 101: The 9-Step Guide to Forming Your Strategy (+ Expert Tips)",
            "How to Add a Link to Your TikTok Bio (+ What to Do If You Can't)",
            "Tyler, the Creator Deserves To Be Mentioned Alongside Hip-Hop’s Greats",
            "How Brands Find New Audiences As Media Habits Shift",
            "Paul beats Tyson as former heavyweight champ fails to turn the clock back",
            "‘Do you sell cars?’: Jaguar’s rebrand prompts mockery, confusion online",
            "Mike Tyson vs Jake Paul: What’s behind the celebrity boxing craze?",
            "Allying with Trump, Elon Musk is the latest billionaire to seek gov’t power",
            "Adobe Tools That Will Empower Creators in 2024 and Beyond",
            "Incoming Sony Pictures Entertainment President and CEO Ravi Ahuja to Headline Variety’s Entertainment Summit at CES",
            "Joe Rogan and the Fifth Estate: How the Podcaster and a Group of Cable News Exiles Became More Powerful Than Traditional Media",
            "It’s Not Too Late to Read That Entire Book With Your Students",
            "Meta’s AI Abundance",
            "Fuentes doxxed...",
            "Bezos rivalry heats up...",
            "Why the Right Thinks He's Running Away With the Race...",
            "Social media management explained [COMPLETE GUIDE]",
            "Social media audience analysis: An easy tactical guide for 2025",
            "Short form vs long form content: Which do audiences prefer?",
            "“Hope She Enjoys Prison”: Influencer Arrested After Flaunting Shoplifted Goods On TikTok",
            "Female Bodybuilding Influencer, 35, Suddenly Passes Away Three Days After Her Birthday",
            "Influencer’s ‘Worst Fear’ Came True After Boyfriend Proposes When Her Nails Weren’t Done",
            "Man Without An Anus Reveals His Unusual Bowel Routine: “This Could Go Wrong”",
            "“Disgusting”: Bodybuilder Joey Swoll Slams OF Model For Grinding On Barbell In A Gym",
            "“Call The Police”: Trans Woman Beats Up Man Who Insulted Her Before Sharing Anti-Violence Post",
            "“Beyond Desperate”: 21YO Sparks Age Gap Debate After Posting TikTok With 44YO “Dad” Boyfriend",
            "Jake Paul Issues Apology Over Mike Tyson Win As Fans Spot Clue That Fuels “Staged” Allegations",
            "Influencing boomed to a $250B industry — and many small creators feel pushed out",
            "Gen Z is reimagining the iconic 70s brand L'eggs",
            "Jake Paul Endorses Donald Trump For President; Encourages Fans To Vote On His Behalf As He Can’t From Puerto Rico",
            "YMU Signs Presenter-Influencers Jack Remmington & Ash Holme",
            "Britt Robertson To Star In Holiday Rom-Com ‘Love Unexpected’ For Premiere Entertainment Group",
            "Matt Walsh Comedy ‘The Unexpecteds’ Wins Best Comedy At Kevin Smith’s Smodcastle Film Festival",
            "Media CEOs Weigh In On Washington Post And LA Times Non-Endorsements Of Kamala Harris, AI And Covering Trump 2.0",
            "‘The Diary Of A CEO’ Hits 1B Streams; Molly-Mae Lands Amazon Series; Jay Hunt Latest Chair Role – Global Briefs",
            "‘Peas And Carrots’ On Menu At Upcoming Dances With Films Festival — New York",
            "Influencer spending increases in Q4 after election blackout as brands integrate channels, commerce",
            "Marketing execs believe deeper relationships, understanding influencers can avoid potential backlash in politics",
            "Monks’ head of social sees this as the biggest challenge for marketers in the creator economy",
            "Creators weigh content decisions and costs of election-driven marketing blackout",
            "Media Buying Briefing: Debating the pros and cons of principal media",
            "Inside the strategy that grew Cristiano Ronaldo’s YouTube account to 1M subscribers in 90 minutes",
            "Future of TV Briefing: How the European creator economy compares to the U.S.",
            "Digiday+ Research: Deloitte, Wrangler and other execs dig into holiday marketing strategies",
            "AI Briefing: Concerns about misinformation grow on the eve of the U.S. elections",
            "How independent agencies are staking their claim in the creator economy",
            "At the Las Vegas Grand Prix, Mastercard joins a pack of consumer brands flocking to Formula One",
            "Ganadores los Ad Social Media Awards 2024: la publicidad que brilla en redes sociales",
            "Dentsu School of Influence: formación para influencers con futuro profesional",
            "La creatividad es (más que nunca) el abono que hace echar brotes verdes a las empresas",
            "How Backspace Marketing Aligns Social Media and SEO for Digital Success",
            "Social Media and Substance Abuse: The Digital Landscape and Ties to Addiction Risks",
            "Boosting E-commerce Sales with Backspace Marketing’s 2024 SEO Strategies",
            "Acquiring customers for affiliate marketing",
            "Fitness, Fame, and Fearlessness: How Leslie Lux and Her Fans Defy the Ordinary"
        ]
    }
]